INSERT INTO Faculty (NameRus, ExtraBool1, ExtraBool3)
VALUES
('Архитектурно-строительный факультет', 0, 1),
('Исторический факультет', 0, 1),
('Механико-математический факультет', 0, 1),
('Транспортно-энергетический факультет', 0, 1),
('Факультет естественных наук', 0, 1),
('Факультет журналистики и политологии', 0, 1),
('Факультет информационных технологий', 0, 1),
('Факультет международных отношений', 0, 1),
('Факультет социальных наук', 0, 1),
('Физико-технический факультет', 0, 1),
('Филологический факультет', 0, 1),
('Экономический факультет', 0, 1),
('Юридический факультет', 0, 1);


INSERT INTO AcademicDepartment (NameRus, FacultyId)
VALUES

('Кафедра архитектуры', 4),
('Кафедра геодезии и картографии', 4),
('Кафедра дизайна и инженерной графики', 4),
('Кафедра проектирования зданий и сооружений', 4),
('Кафедра технологии промышленного и гражданского строительства', 4),

('Кафедра археологии и этнологии', 5),
('Кафедра истории Казахстана', 5),

('Кафедра алгебры и геометрии', 6),
('Кафедра высшей математики', 6),
('Кафедра математического и компьютерного моделирования', 6),
('Кафедра механики', 6),
('Кафедра фундаментальной математики', 6),

('Кафедра организации перевозок движения и эксплуатации транспорта', 7),
('Кафедра стандартизации, сертификации и метрологии', 7),
('Кафедра теплоэнергетики', 7),
('Кафедра транспорта, транспортной техники и технологии', 7),

('Кафедра биотехнологии и микробиологии', 8),
('Кафедра общей биологии и геномики', 8),
('Кафедра управления и инжиниринга в сфере охраны окружающей среды', 8),
('Кафедра физической и экономической географии', 8),
('Кафедра химии', 8),

('Кафедра политологии', 9),
('Кафедра печати и издательского дела', 9),
('Кафедра телерадио и связи с общественностью', 9),

('Кафедра вычислительной техники', 10),
('Кафедра информатики', 10),
('Кафедра информатики и информационной безопасности', 10),
('Кафедра информационных систем', 10),
('Кафедра системного анализа и управления', 10),

('Кафедра международных отношений', 11),
('Кафедра востоковедения', 11),
('Кафедра иностранных языков', 11),
('Кафедра регионоведения', 11),
('Кафедра тюркологии', 11),
('Кафедра Ассамблеи народа Казахстана', 11),
('Кафедра Жан Моне Европейская дипломатия', 11),

('Кафедра религиоведения', 12),
('Кафедра социологии', 12),
('Кафедра философии', 12),
('Кафедра социальной педагогики и самопознания', 12),
('Кафедра физической культуры и спорта', 12),

('Международная кафедра ядерной физики, новых материалов и технологий', 13),
('Кафедра космической техники и технологии', 13),
('Кафедра общей и теоретической физики', 13),
('Кафедра радиотехники, электроники и телекоммуникаций', 13),
('Кафедра технической физики', 13),

('Кафедра казахского языкознания', 14),
('Кафедра казахской литературы', 14),
('Кафедра русской филологии', 14),
('Кафедра теории и практики перевода', 14),
('Кафедра иностранной филологии', 14),
('Кафедра теории и практики иностранных языков', 14),
('Кафедра китайской филологии', 14),
('Кафедра теоретической и прикладной лингвистики', 14),
('Кафедра практического казахского языка', 14),
('Кафедра иностранных языков', 14),

('Кафедра экономики и предпринимательства', 15),
('Кафедра менеджмента', 15),
('Кафедра туризма', 15),
('Кафедра финансов', 15),
('Кафедра учета и анализа', 15),
('Кафедра государственного аудита', 15),

('Кафедра международного права', 16),
('Кафедра уголовно-правовых дисциплин', 16),
('Кафедра гражданского, трудового и экологического права', 16),
('Кафедра теории и истории государства и права, конституционного права', 16);











